## Embryo Options | Inventory Exercises - Data Analyst
### Linnea Miller | 5.12.19

## Updates

## -------------------------------------------------------------------

### Load data

In [1]:
import pandas as pd
from pandas import ExcelWriter, ExcelFile

In [2]:
# Read in .xlsx file
charges_x = pd.read_excel('Full Embryo Cryo Inventory-Scrubbed.xlsx', 
              sheet_name = 'PostCharges - Export')

countries_x =  pd.read_excel('Full Embryo Cryo Inventory-Scrubbed.xlsx', 
              sheet_name = 'Countries')

territories_x =  pd.read_excel('Full Embryo Cryo Inventory-Scrubbed.xlsx', 
              sheet_name = 'StateProvinceTerritories')

# Read in .csv file to establish red rows
red_rows_x = pd.read_csv('./red_rows.csv')

In [3]:
charges_x.shape

(2203, 21)

In [4]:
# Read in .csv files
charges = pd.read_csv('./PostCharges - Export.csv')
territories = pd.read_csv('./StateProvinceTerritories.csv')
countries = pd.read_csv('./Countries.csv')
red_rows = pd.read_csv('./red_rows.csv')

In [5]:
charges.shape

(2201, 21)

`-`
***Why are there 2 more rows when imported as an .xlsx file?***
`-`

Because the last two rows in the .xlsx import are null.

In [6]:
charges_x.drop(charges_x.index[[2201, 2202]], inplace=True)

In [7]:
charges_x.shape

(2201, 21)

### Overview of data

##### 1. `charges`

In [8]:
charges.head()

,EMR,Last Name,First Name,DOB,Partner,# Embryos,# Oocytes,Tank,Canister-Color,Donated From,...,Billing Month,Comments,Address 1,Address 2,City,State,Zip,Country,Primary Phone,Email
0,503113.0,Last503113,First503113,11/4/72,"PartnerLast503113, PartnerFirst503113",3,0.0,V,11-Blue,NaN,...,December,NaN,107 Main St.,NaN,West Jordan,UT,84081,USA,3.054591e+09,notanemail884@example.com
1,909895.0,Last909895,First909895,11/20/87,"PartnerLast909895, PartnerFirst909895",3,0.0,S,7-Silver,NaN,...,December,NaN,863 Main St.,NaN,Salt Lake City,UT,84106,USA,6.186166e+09,notanemail50@example.com
2,93361.0,Last93361,First93361,5/13/90,"PartnerLast93361, PartnerFirst93361",6,0.0,J,8-Pink,NaN,...,July,NaN,216 Main St.,NaN,Moroni,UT,84646,USA,6.344384e+09,notanemail512@example.com
3,937394.0,Last937394,First937394,7/15/79,"PartnerLast937394, PartnerFirst937394",4,0.0,S,5-Orange,NaN,...,September,NaN,932 Main St.,NaN,Bluffdale,UT,84065,USA,2.736603e+09,notanemail908@example.com
4,216833.0,Last216833,First216833,1/31/85,"PartnerLast216833, PartnerFirst216833",5,0.0,V,2-Yellow,NaN,...,April,NaN,4 Main St.,NaN,Eagle Mountain,UT,84005,USA,5.640751e+09,notanemail562@example.com

In [9]:
charges_x.head()

,EMR,Last Name,First Name,DOB,Partner,# Embryos,# Oocytes,Tank,Canister-Color,Donated From,...,Billing Month,Comments,Address 1,Address 2,City,State,Zip,Country,Primary Phone,Email
0,NaN,Last915553,First212,1984-07-12 00:00:00,"PartnerLast804628, PartnerFirst748242",3,0,N,3-Green,NaN,...,September,Discard,453 Main St.,NaN,Lehi,UT,84043,USA,NaN,notanemail908@example.com
1,NaN,Last26280,First292222,1994-01-19 00:00:00,"PartnerLast895676, PartnerFirst384420",4,0,K,7-Yellow,NaN,...,February,Donate to research,145 Main St.,NaN,West Jordan,UT,84081,USA,NaN,notanemail610@example.com
2,944874.0,Last944874,First944874,1979-12-01 00:00:00,"PartnerLast944874, PartnerFirst944874",4,0,S,4-Silver,NaN,...,November,Donate to research,609 Main St.,NaN,Orem,UT,84057,USA,2.585908e+09,notanemail279@example.com
3,NaN,Last260308,First982213,1981-04-26 00:00:00,"PartnerLast294652, PartnerFirst328208",3,0,M,20-Pink,NaN,...,April,Donate to research,681 Main St.,NaN,Rexburg,ID,83440,USA,NaN,notanemail641@example.com
4,NaN,Last802195,First866153,1988-06-30 00:00:00,"PartnerLast111122, PartnerFirst888945",8,0,N,12-Green,NaN,...,February,Donate to research,823 Main St.,NaN,Lehi,UT,84043,USA,NaN,notanemail893@example.com

In [10]:
# list(charges.columns)

In [11]:
# Create column called 'Full Name' --> combine First and Last name columns
charges['Full Name'] = charges[['Last Name', 'First Name']].apply(lambda x: ', '.join(x), axis=1)

In [12]:
# Create column called 'Full Name' --> combine First and Last name columns
charges_x['Full Name'] = charges_x[['Last Name', 'First Name']].apply(lambda x: ', '.join(x), axis=1)

##### 2. `territories`

In [13]:
territories.head()

    ID Country Abbreviation State Abbreviation        State Name
0  AT1                   AT                  1        Burgenland
1  AT2                   AT                  2           Karnten
2  AT3                   AT                  3  Niederosterreich
3  AT4                   AT                  4    Oberosterreich
4  AT5                   AT                  5          Salzburg

In [14]:
territories_x.head()

    ID Country Abbreviation State Abbreviation        State Name
0  AT1                   AT                  1        Burgenland
1  AT2                   AT                  2           Karnten
2  AT3                   AT                  3  Niederosterreich
3  AT4                   AT                  4    Oberosterreich
4  AT5                   AT                  5          Salzburg

##### 3. `countries`

In [15]:
countries.head()

,Country Abbreviation,Country Name (*This sheet should be sorted by this column for LOOKUP function to work)
0,AF,Afghanistan
1,AL,Albania
2,DZ,Algeria
3,AD,Andorra
4,AO,Angola

In [16]:
countries_x.head()

,Country Abbreviation,Country Name (*This sheet should be sorted by this column for LOOKUP function to work)
0,AF,Afghanistan
1,AL,Albania
2,DZ,Algeria
3,AD,Andorra
4,AO,Angola

In [17]:
# Rename 2nd column in countries to simplify
countries = countries.rename(columns={'Country Name (*This sheet should be sorted by this column for LOOKUP function to work)':'Country Name'})

In [18]:
countries_x = countries_x.rename(columns={'Country Name (*This sheet should be sorted by this column for LOOKUP function to work)':'Country Name'})

##### 4. `red_rows`

In [19]:
red_rows.head(3)

,EMR,Last Name,First Name,DOB,Partner,# Embryos,# Oocytes,Tank,Canister-Color,Donated From,...,Billing Month,Comments,Address 1,Address 2,City,State,Zip,Country,Primary Phone,Email
0,NaN,Last915553,First212,7/12/84,"PartnerLast804628, PartnerFirst748242",3,0,N,3-Green,NaN,...,September,Discard,453 Main St.,NaN,Lehi,UT,84043,USA,NaN,notanemail908@example.com
1,NaN,Last26280,First292222,1/19/94,"PartnerLast895676, PartnerFirst384420",4,0,K,7-Yellow,NaN,...,February,Donate to research,145 Main St.,NaN,West Jordan,UT,84081,USA,NaN,notanemail610@example.com
2,944874.0,Last944874,First944874,12/1/79,"PartnerLast944874, PartnerFirst944874",4,0,S,4-Silver,NaN,...,November,Donate to research,609 Main St.,NaN,Orem,UT,84057,USA,2.585908e+09,notanemail279@example.com

In [20]:
# Create column called 'Full Name' --> combine First and Last name columns
red_rows['Full Name'] = red_rows[['Last Name', 'First Name']].apply(lambda x: ', '.join(x), axis=1)

## -------------------------------------------------------------------

### Question 1

*Question: How many unique patients are there in the dataset?*

In [21]:
# Look at shape of the table to see TOTAL # of rows
charges_x.shape

(2201, 22)

In [22]:
# Using set function to find unique rows (i.e. unique patients)
len(set(charges['EMR']))

2201

In [23]:
len(set(charges_x['EMR']))

2201

In [24]:
# Verify using 'Full Name' column
charges_x['Full Name'].describe()

count                        2201
unique                       2201
top       Last302835, First302835
freq                            1
Name: Full Name, dtype: object

***Answer:*** 2201 unique patients.

## -------------------------------------------------------------------

### Question 2

*Question: Identify all patients without an EMR number.*

***Answer:***

In [25]:
charges[charges['EMR'].isnull()].shape

(61, 22)

In [26]:
charges_x[charges_x['EMR'].isnull()].shape

(61, 22)

## -------------------------------------------------------------------

### Question 3

*Question: Identify all patients with an invalid Date of Birth.*

In [27]:
# Change from string to datetime format

for x in range(len(charges_x)):    
    try:
        charges_x['DOB'][x] = pd.to_datetime(charges_x['DOB'][x])
    except:
        # print rows that can't be changed to datetime
        print(x)
        pass

/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """

408
1494

In [29]:
charges_x.iloc[408]

EMR                                              484183
Last Name                                    Last484183
First Name                                  First484183
DOB                                 4579-11-05 00:00:00
Partner           PartnerLast484183, PartnerFirst484183
# Embryos                                            12
# Oocytes                                             0
Tank                                                  V
Canister-Color                                 5-Yellow
Donated From                                        NaN
Date In                             2018-08-23 00:00:00
Billing Month                                    August
Comments                                            NaN
Address 1                                  154 Main St.
Address 2                                           NaN
City                                     Salt Lake City
State                                                UT
Zip                                               84120
Country                                             USA
Primary Phone                                1.9623e+09
Email                         notanemail717@example.com
Full Name                       Last484183, First484183
Name: 408, dtype: object

In [30]:
charges_x.iloc[1494]

EMR                                                 313332
Last Name                                       Last313332
First Name                                     First313332
DOB                                    4565-11-06 00:00:00
Partner              PartnerLast313332, PartnerFirst313332
# Embryos                                               13
# Oocytes                                                0
Tank                             V                       V
Canister-Color    1-Pink                            7-Blue
Donated From                                           NaN
Date In              4/12/18                       9/29/18
Billing Month                                        April
Comments                                               NaN
Address 1                                     346 Main St.
Address 2                                              NaN
City                                            Clearfield
State                                                   UT
Zip                                                  84015
Country                                                USA
Primary Phone                                  3.84506e+09
Email                             notanemail53@example.com
Full Name                          Last313332, First313332
Name: 1494, dtype: object

In [31]:
charges_x['DOB'].sort_values().tail()

1661    2018-06-25 00:00:00
664     2019-01-21 00:00:00
1131    2019-03-15 00:00:00
1494    4565-11-06 00:00:00
408     4579-11-05 00:00:00
Name: DOB, dtype: object

In [ ]:
# charges_x['DOB'].sort_values().tail(45)

***Answer:*** When changing the datatype from string to datetime, any row with a DOB *before the year of 1969* get's incorrectly converted to future dates that aren't currently valid birthdays. 

For example, `11/25/68` *incorrectly* becomes `2068-11-25`, whereas `11/20/69` *correctly* becomes `1969-11-20`.

In [ ]:
# All invalid DOB
charges_x[charges_x['DOB'] > '2019-12-31']

***Answer:*** I'm also wondering if it makes sense for anyone under the age of 18 to be able to store their embryos/oocytes - I would want to verify that these birthdays are valid.

In [ ]:
charges_x[(charges_x['DOB'] < '2019-5-5') & (charges_x['DOB'] > '2001-5-5')]

In [ ]:
# set(charges_x['Zip'])
type(charges_x['Zip'].dtypes

## -------------------------------------------------------------------

### Question 4

*Q: Identify all patient addresses that do not have a valid country or state code.*

##### 1. Isolate rows where `'Address 1'` is populated.

In [ ]:
has_address = charges[['Address 1', 'Address 2', 'City', 'State', 'Zip', 'Country']][charges['Address 1'].notnull()]
has_address.head()

##### 2. Compare country codes in `charges` table with those in the `countries` table.

In [ ]:
# Identify all Country codes that occur in original charges table
set(charges['Country'])

In [ ]:
# Set of all Country codes that exist in the has_address table
country_charges = set(has_address['Country'])
country_charges

In [ ]:
# Set of all Country codes that exist in the countries table
country_countries = set(list(countries['Country Abbreviation']))

In [ ]:
# Find invalid Country codes
invalid_country = list(country_charges - country_countries)
invalid_country

***Answer***: *ALL* United States addresses in the `charges` table are **invalid** with `'USA'` instead of `'US'`. The `countries` table deems `'US'` the correct `'Country Abbreviation'` for the United States or USA.

In [ ]:
countries[countries['Country Name'].isin(['United States', 'USA', 'United States of America', 'US'])]

##### 3. Compare state codes in `charges` table with those in the `territories` tables.

In [ ]:
# Set of all State codes that exist in the has_address table
states_charges = set(has_address['State'])
# states_charges

In [ ]:
# Set of all State codes that exist in the territories table
states_territories = set(list(territories['State Abbreviation']))
# states_territories

In [ ]:
# Find invalid 'State' codes
invalid_states = list(states_charges - states_territories)
invalid_states

***Answer***: The resulting table shows the rows in `charges` where the `State` code is **invalid**.

In [ ]:
has_address[has_address['State'].isin(invalid_states)]

In [ ]:
# # Get list of index values for all invalid State code rows
# invalid_1 = list(has_address[has_address['State'].isin(invalid_states)].index)

##### 4. Check nulls

***Answer:*** The resulting table shows the rows in `charges` where the `'State'` code OR `'Country'` code is **NULL**.

In [ ]:
# Find all rows where State code OR Country code is NULL
has_address[(has_address['State'].isnull()) | (has_address['Country'].isnull())]

In [ ]:
# # Get list of index values for all null rows
# invalid_2 = list(has_address[(has_address['State'].isnull()) | (has_address['Country'].isnull())].index)

##### 5. Final overview

All invalid rows were in one of 2 groups:
1. Invalid `'Country'` code - either **null** or **USA** which is NOT the correct country code according to the `countries` table.
2. Invalid `'State'` code - either **null** or an **incorrect code** :`['XY', 'VW', 'CD', 'AE', 'UX', 'AW']`.

##### 6. Other observations/EDA

- Notice `has_address.iloc[1720]` which has city/state/country information in the `Address 2` column instead of in the *appropriate* columns. Based on the `countries` table, the country code for Switzerland would be `CH`.

In [ ]:
# Verify Switzerland is valid country name & find out what the country abbreviation is for this specific row
countries[countries['Country Name'] == 'Switzerland']

- `has_address.iloc[1812]` has an error. The country code appears in the `'Zip'` column instead of the `'Country'` column. If `'CA'` was in the `'Country'` column, it *would* be a valid country code!!

In [ ]:
# Verify CA is valid country abbreviation
countries[countries['Country Abbreviation'] == 'CA']

The rows in `charges` where `Country` == `'ESP'` have an invalid country code. The official country abbreviation is `'ES'`, not `'ESP'`.

In [ ]:
# Look up Country Abbreviation values in countries table
countries[countries['Country Abbreviation'].isin(['ES', 'ESP', 'EP', 'SP'])]

## -------------------------------------------------------------------

### Question 5

*Question: Identify all records where the 'Billing Month' does not match the month of the 'Date In'.*

***Approach:*** Create two new columns that contain the numeric value of the months from both original columns (*'Billing Month'* and *'Date In'*). Do this by converting each column to datetime in some form and pulling the **month** information. Finally, find the rows where the values in the two newly created columns *don't* match.

##### 1.  Nulls

In [ ]:
# Check for null values
charges[['Date In', 'Billing Month']].isnull().sum()

In [ ]:
# Replace all null cells with a string ('?') and leave all other cells as they are
charges['Billing Month'] = charges['Billing Month'].map(lambda x: '?' if str(x) == 'nan' else str(x))
charges['Date In'] = charges['Date In'].map(lambda x: '?' if str(x) == 'nan' else x)

##### 2. Clean up `'Date In'` columns

In [ ]:
import re

In [ ]:
# Clean up 'Date In' column
for i in range(len(charges)):
    
    c = charges['Date In'][i]
    charges['Date In'][i] = re.sub('\s+', ' ', c).strip().split(' ')
    
    if i % 500 == 0:
        print(i)

In [ ]:
charges['Date In'].tail(20)

In [ ]:
# Create empty DataFrame (date_in_fix) with identical index to charges DataFrame
date_in_fix = pd.DataFrame(columns = ['Date In - 1', 'Date In - 2', 'Date In - 3', 'Date In - 4', 'Date In - 5'], index=charges.index)

In [ ]:
# Populate empty DataFrame with 'Date In' dates
for i in range(len(charges)): 
    if len(charges['Date In'][i]) == 1:
        date_in_fix['Date In - 1'][i] = str(charges['Date In'][i][0])
    
    elif len(charges['Date In'][i]) == 2:
        date_in_fix['Date In - 1'][i] = str(charges['Date In'][i][0])
        date_in_fix['Date In - 2'][i] = str(charges['Date In'][i][1])
    
    elif len(charges['Date In'][i]) == 3:
        date_in_fix['Date In - 1'][i] = str(charges['Date In'][i][0])
        date_in_fix['Date In - 2'][i] = str(charges['Date In'][i][1])
        date_in_fix['Date In - 3'][i] = str(charges['Date In'][i][2])
    
    elif len(charges['Date In'][i]) == 4:
        date_in_fix['Date In - 1'][i] = str(charges['Date In'][i][0])
        date_in_fix['Date In - 2'][i] = str(charges['Date In'][i][1])
        date_in_fix['Date In - 3'][i] = str(charges['Date In'][i][2])
        date_in_fix['Date In - 4'][i] = str(charges['Date In'][i][3])
        
    elif len(charges['Date In'][i]) >= 5:
        date_in_fix['Date In - 1'][i] = str(charges['Date In'][i][0])
        date_in_fix['Date In - 2'][i] = str(charges['Date In'][i][1])
        date_in_fix['Date In - 3'][i] = str(charges['Date In'][i][2])
        date_in_fix['Date In - 4'][i] = str(charges['Date In'][i][3])
        date_in_fix['Date In - 5'][i] = str(charges['Date In'][i][4])
    
    else:
        pass

In [ ]:
# Check for nulls
date_in_fix[date_in_fix['Date In - 1'].isnull()]

In [ ]:
# Concatenate charges and date_in_fix
charges = pd.concat([charges, date_in_fix], axis=1)

In [ ]:
charges[['Date In - 1', 'Date In - 2', 'Date In - 3', 'Date In - 4', 'Date In - 5']].tail(20)

##### 3. Get month numbers

In [ ]:
from datetime import datetime

In [ ]:
# Create function that will yield the corresponding number to the 'Billing Month'
def month_bill(x):
    d = datetime.strptime(x, '%B')
    if x != '?':
        return int(d.strftime('%m'))
    else:
        return x

In [ ]:
# Create new column with 'Billing Month' converted into corresponding number (int) if doesn't equal '?'
# Using month_bill function from above
charges['Bill_Month_num'] = charges['Billing Month'].map(lambda x: month_bill(x) if x != '?' else x)

In [ ]:
# Create function that will yield the corresponding number to the 'Date In'
def month_datein(x):
    # Using try/except here in case there are any weird strings that don't fit the format I define below
    try: 
        d = datetime.strptime(x, '%m/%d/%y')
        if x != '?':
            return int(d.strftime('%m'))
    except:
        d = datetime.strptime(x, '%m/%d/%Y')
        if x!= '?':
            return int(d.strftime('%m'))

In [ ]:
# Create new column with 'Date In' converted into corresponding number (int) if doesn't equal '?'
# Using month2 function from above
charges['Date_In_num'] = charges['Date In - 1'].map(lambda x: month_datein(x) if x != '?' else x)

In [ ]:
charges[['Billing Month', 'Bill_Month_num', 'Date In - 1', 'Date_In_num']].head()

In [ ]:
# Find the rows where the month values don't match
non_match = charges[['Billing Month', 'Bill_Month_num', 'Date In - 1', 'Date In - 2', 'Date_In_num']][charges['Bill_Month_num'] != charges['Date_In_num']]

In [ ]:
# Find how many rows out of the whole dataset have mismatching months
len(non_match)

In [ ]:
# Show records where 'Billing Month' does not match the month of the 'Date In'
non_match.head(10)
# non_match

***Answer:*** After cleaning the data to an extent, I've found two patterns concerning the rows containing months that "don't match":

1. `'Bill_Month_num'` = `'?'` when `'Date_In_num'` is some integer 

*Example:* `charges.iloc[26]`

In [ ]:
charges[['Bill_Month_num', 'Date_In_num']].iloc[26]

In [ ]:
non_match[non_match['Billing Month'] == '?']

2. `'Bill_Month_num'` and `'Date_In_num'` are both integers but don't match.
*Example:* `charges.iloc[399]`

In [ ]:
charges[['Bill_Month_num', 'Date_In_num']].iloc[399]

The rows where the `'Billing Month'` does NOT match the `'Date In'` month are those in which the the `'Billing Month'` either isn't reflecting the month of the **most recent** `'Date In'` or is just straight-up incorrect!

It would obviously take additional research to figure out why some of the `'Bill_Month_num'` rows contained nulls (i.e. '?').

In [ ]:
 non_match[non_match['Billing Month'] != '?']

## -------------------------------------------------------------------

### Question 6

*Question: Create a combined list of all non-zero embryo and egg records (so we can track embryo and egg records separately).*

##### 1. Clean `'# Embryos'` column

In [ ]:
# Check datatypes
charges[['# Embryos', '# Oocytes']].dtypes

In [ ]:
# Find any strings that aren't pure numbers
bad_string = []
for i in range(len(charges)):
    try:
        if len(charges['# Embryos'][i]) > 2:
            bad_string.append(i)
        else:
            pass
    except:
        pass

In [ ]:
bad_string

In [ ]:
charges[['# Embryos']].iloc[2053]

Since this particular row has non-numeric characters, I'll change the value to `'10'` since it says 15 (minus 5). In a real-life scenario, I would double check with the specific clinic to see what the actual value should be if not 10.

In [ ]:
charges['# Embryos'].iloc[2053] = '10'

In [ ]:
charges[['# Embryos']].iloc[2053]

##### 2. Convert `'# Embryos'` column to dtype = float

In [ ]:
charges['# Embryos'] = charges['# Embryos'].map(lambda x: float(x))

In [ ]:
charges[['# Embryos', '# Oocytes']].dtypes

##### 3. Create list of non-zero embryo & egg records

In [ ]:
# # Find all rows where '# Embryos' OR '# Oocytes' are NOT 0
# charges[(charges['# Embryos'] != 0) | (charges['# Oocytes'] != 0)]

In [ ]:
# Create separate lists of row ids to reflect the possibility of there being two differeny records for one 'EMR'
embryos = list(charges[charges['# Embryos'] != 0].index)
oocytes = list(charges[charges['# Oocytes'] != 0].index)

In [ ]:
# Gather embryo records into DataFrame
em = charges[['EMR', 'Full Name', '# Embryos', 'Date In - 1', 'Date_In_num']].loc[embryos]
em['Type'] = 'embryo'
em.rename(columns={'# Embryos':'#'}, inplace=True)
em.reset_index(inplace=True, drop=True)

In [ ]:
# Gather oocyte records into DataFrame
oo = charges[['EMR', 'Full Name', '# Oocytes', 'Date In - 1', 'Date_In_num']].loc[oocytes]
oo['Type'] = 'oocyte'
oo.rename(columns={'# Oocytes':'#'}, inplace=True)
oo.reset_index(inplace=True, drop=True)

In [ ]:
# Concat the two tables
non_zero_records = pd.concat([em, oo])
non_zero_records.reset_index(inplace=True, drop=True)

In [ ]:
# Reformat table
all_tissue = non_zero_records[['EMR', 'Full Name', 'Type', '#', 'Date In - 1', 'Date_In_num']]

***Answer:***

In [ ]:
all_tissue.head(10)

In [ ]:
# Example of two separate records for the same EMR
all_tissue[all_tissue['EMR'] == 668790.0]

## -------------------------------------------------------------------

### Question 7

*Question: Given the list from question 6, within each specimen type, the clinic has decided to charge each patient only for their oldest record (based on the 'Date In'). In addition, some records have been highlighted in red and should not be billed.* 

*Identify all records as billable or non-billable.*

##### 1. Check for duplicates and nulls

In [ ]:
# # Check for null Last Name in red_rows --> no nulls
# red_rows[red_rows['Full Name'].isnull()]

In [ ]:
# # Check for duplicate Last Name in red_rows --> no dups
# red_rows[red_rows['Full Name'].duplicated() == True]

In [ ]:
# # Check for null Last Name in all_tissue --> no nulls
# all_tissue[all_tissue['Full Name'].isnull()]

In [ ]:
# # Check for duplicate Last Name in all_tissue
# all_tissue[all_tissue['Full Name'].duplicated() == True]

In [ ]:
full_name_dups = list(all_tissue[all_tissue['Full Name'].duplicated() == True]['Full Name'])

##### 2. Identify/label non-billable rows

In [ ]:
all_tissue['Billable'] = None

In [ ]:
red = list(red_rows['Full Name'])

(The following code takes a minute to run)

In [ ]:
# If corresponding to a red row, NOT billable --> 0
# If not corresponding to a red row, billable --> 1
for i in range(len(all_tissue)):
    if all_tissue['Full Name'][i] in red:
        all_tissue['Billable'].iloc[i] = 0 # i.e. not-billable
    else:
        all_tissue['Billable'].iloc[i] = 1 # i.e. billable

In [ ]:
# Verify new 'Billable' column
all_tissue[all_tissue['Billable'] == 0].head()

In [ ]:
all_tissue.tail(10)
# all_tissue

## -------------------------------------------------------------------

### Question 8

*Question: Given the list of billable from question 7, calculate the number of records that will be billed in each month (assuming records are billed once a year on their `'Date In'` anniversary.*

In [ ]:
import matplotlib, matplotlib.pyplot as plt
import seaborn as sns

%matplotlib inline
%config InlineBackend.figure_format = 'retina'

In [ ]:
billable = all_tissue[all_tissue['Billable'] == 1]

In [ ]:
def monthly_bill_count(month_num):
    return len(billable[billable['Date_In_num'] == month_num])

In [ ]:
x = ['JAN', 
     'FEB', 
     'MAR', 
     'APR', 
     'MAY', 
     'JUNE', 
     'JULY', 
     'AUG', 
     'SEP', 
     'OCT', 
     'NOV', 
     'DEC', 
     'Unknown']

y = [monthly_bill_count(1),
    monthly_bill_count(2),
    monthly_bill_count(3),
    monthly_bill_count(4),
    monthly_bill_count(5),
    monthly_bill_count(6),
    monthly_bill_count(7),
    monthly_bill_count(8),
    monthly_bill_count(9),
    monthly_bill_count(10),
    monthly_bill_count(11),
    monthly_bill_count(12),
    monthly_bill_count('?')]

In [ ]:
def show_counts():
    for i in range(13):    
        print(x[i], ': ', y[i])

***Answer: ***

In [ ]:
show_counts()

In [ ]:
plt.figure(figsize=(10, 7))
plt.title('# of Billable Records per Month')
matplotlib.rc('font', size=11)
matplotlib.rc('axes', titlesize=14)
sns.barplot(x, y).set_xticklabels(x, rotation=40)

plt.show();